{"format": "layers-model", "generatedBy": "keras v2.12.0", "convertedBy": "TensorFlow.js Converter v4.3.0", "modelTopology": {"keras_version": "2.12.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 512, 512, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "lambda_input"}}, {"class_name": "Lambda", "config": {"name": "lambda", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAADAAAAQwAAAPMMAAAAdABqAaACfAChAVMAqQFOKQPaAnRm2gVpbWFn\nZdoQcmdiX3RvX2dyYXlzY2FsZakB2gF4qQByCAAAAPoaL2hvbWUvdWJ1bnR1L2JsdXJfbW9kZWwu\ncHnaCDxsYW1iZGE+BgAAAPMCAAAADAA=\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}}, {"class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAADAAAAQwAAAPMMAAAAdABqAaACfAChAVMAqQFOKQPaAnRm2gVpbWFn\nZdoLc29iZWxfZWRnZXOpAdoBeKkAcggAAAD6Gi9ob21lL3VidW50dS9ibHVyX21vZGVsLnB52gg8\nbGFtYmRhPggAAADzAgAAAAwA\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Lambda", "config": {"name": "lambda_2", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAADAAAAQwAAAPMMAAAAdABqAaACfAChAVMAqQFOKQPaAnRm2gRtYXRo\n2g9yZWR1Y2VfdmFyaWFuY2WpAdoBeKkAcggAAAD6Gi9ob21lL3VidW50dS9ibHVyX21vZGVsLnB5\n2gg8bGFtYmRhPgwAAADzAgAAAAwA\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}}]}}, "training_config": {"loss": "mse", "metrics": null, "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Custom>Adam", "config": {"name": "Adam", "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "jit_compile": false, "is_legacy_optimizer": false, "learning_rate": 0.0010000000474974513, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": [], "weights": []}]}